espressif/esp-idf/components/soc/esp32s31/register/soc/cpu_apm_reg.h
/** CPU_APM_REGION4_ATTR_REG register
 *  Region access authority attribute register
 */
#define CPU_APM_REGION4_ATTR_REG (DR_REG_CPU_APM_BASE + 0x3c)
/** CPU_APM_REGION4_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 4.
 */
#define CPU_APM_REGION4_R0_X    (BIT(0))
#define CPU_APM_REGION4_R0_X_M  (CPU_APM_REGION4_R0_X_V << CPU_APM_REGION4_R0_X_S)
#define CPU_APM_REGION4_R0_X_V  0x00000001U
#define CPU_APM_REGION4_R0_X_S  0
/** CPU_APM_REGION4_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 4.
 */
#define CPU_APM_REGION4_R0_W    (BIT(1))
#define CPU_APM_REGION4_R0_W_M  (CPU_APM_REGION4_R0_W_V << CPU_APM_REGION4_R0_W_S)
#define CPU_APM_REGION4_R0_W_V  0x00000001U
#define CPU_APM_REGION4_R0_W_S  1
/** CPU_APM_REGION4_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 4.
 */
#define CPU_APM_REGION4_R0_R    (BIT(2))
#define CPU_APM_REGION4_R0_R_M  (CPU_APM_REGION4_R0_R_V << CPU_APM_REGION4_R0_R_S)
#define CPU_APM_REGION4_R0_R_V  0x00000001U
#define CPU_APM_REGION4_R0_R_S  2
/** CPU_APM_REGION4_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 4.
 */
#define CPU_APM_REGION4_R1_X    (BIT(4))
#define CPU_APM_REGION4_R1_X_M  (CPU_APM_REGION4_R1_X_V << CPU_APM_REGION4_R1_X_S)
#define CPU_APM_REGION4_R1_X_V  0x00000001U
#define CPU_APM_REGION4_R1_X_S  4
/** CPU_APM_REGION4_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 4.
 */
#define CPU_APM_REGION4_R1_W    (BIT(5))
#define CPU_APM_REGION4_R1_W_M  (CPU_APM_REGION4_R1_W_V << CPU_APM_REGION4_R1_W_S)
#define CPU_APM_REGION4_R1_W_V  0x00000001U
#define CPU_APM_REGION4_R1_W_S  5
/** CPU_APM_REGION4_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 4.
 */
#define CPU_APM_REGION4_R1_R    (BIT(6))
#define CPU_APM_REGION4_R1_R_M  (CPU_APM_REGION4_R1_R_V << CPU_APM_REGION4_R1_R_S)
#define CPU_APM_REGION4_R1_R_V  0x00000001U
#define CPU_APM_REGION4_R1_R_S  6
/** CPU_APM_REGION4_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 4.
 */
#define CPU_APM_REGION4_R2_X    (BIT(8))
#define CPU_APM_REGION4_R2_X_M  (CPU_APM_REGION4_R2_X_V << CPU_APM_REGION4_R2_X_S)
#define CPU_APM_REGION4_R2_X_V  0x00000001U
#define CPU_APM_REGION4_R2_X_S  8
/** CPU_APM_REGION4_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 4.
 */
#define CPU_APM_REGION4_R2_W    (BIT(9))
#define CPU_APM_REGION4_R2_W_M  (CPU_APM_REGION4_R2_W_V << CPU_APM_REGION4_R2_W_S)
#define CPU_APM_REGION4_R2_W_V  0x00000001U
#define CPU_APM_REGION4_R2_W_S  9
/** CPU_APM_REGION4_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 4.
 */
#define CPU_APM_REGION4_R2_R    (BIT(10))
#define CPU_APM_REGION4_R2_R_M  (CPU_APM_REGION4_R2_R_V << CPU_APM_REGION4_R2_R_S)
#define CPU_APM_REGION4_R2_R_V  0x00000001U
#define CPU_APM_REGION4_R2_R_S  10
/** CPU_APM_REGION4_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 4.
 */
#define CPU_APM_REGION4_TEE_X    (BIT(12))
#define CPU_APM_REGION4_TEE_X_M  (CPU_APM_REGION4_TEE_X_V << CPU_APM_REGION4_TEE_X_S)
#define CPU_APM_REGION4_TEE_X_V  0x00000001U
#define CPU_APM_REGION4_TEE_X_S  12
/** CPU_APM_REGION4_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 4.
 */
#define CPU_APM_REGION4_TEE_W    (BIT(13))
#define CPU_APM_REGION4_TEE_W_M  (CPU_APM_REGION4_TEE_W_V << CPU_APM_REGION4_TEE_W_S)
#define CPU_APM_REGION4_TEE_W_V  0x00000001U
#define CPU_APM_REGION4_TEE_W_S  13
/** CPU_APM_REGION4_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 4.
 */
#define CPU_APM_REGION4_TEE_R    (BIT(14))
#define CPU_APM_REGION4_TEE_R_M  (CPU_APM_REGION4_TEE_R_V << CPU_APM_REGION4_TEE_R_S)
#define CPU_APM_REGION4_TEE_R_V  0x00000001U
#define CPU_APM_REGION4_TEE_R_S  14
/** CPU_APM_REGION4_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define CPU_APM_REGION4_LOCK    (BIT(16))
#define CPU_APM_REGION4_LOCK_M  (CPU_APM_REGION4_LOCK_V << CPU_APM_REGION4_LOCK_S)
#define CPU_APM_REGION4_LOCK_V  0x00000001U
#define CPU_APM_REGION4_LOCK_S  16

/** CPU_APM_REGION5_ADDR_START_REG register
 *  Region address register
 */
#define CPU_APM_REGION5_ADDR_START_REG (DR_REG_CPU_APM_BASE + 0x40)
/** CPU_APM_REGION5_ADDR_START_L : HRO; bitpos: [12:0]; default: 0;
 *  Low 12 bit, start address of region 5.
 */
#define CPU_APM_REGION5_ADDR_START_L    0x00001FFFU
#define CPU_APM_REGION5_ADDR_START_L_M  (CPU_APM_REGION5_ADDR_START_L_V << CPU_APM_REGION5_ADDR_START_L_S)
#define CPU_APM_REGION5_ADDR_START_L_V  0x00001FFFU
#define CPU_APM_REGION5_ADDR_START_L_S  0
/** CPU_APM_REGION5_ADDR_START : R/W; bitpos: [28:13]; default: 0;
 *  Configures start address of region 5.
 */
#define CPU_APM_REGION5_ADDR_START    0x0000FFFFU
#define CPU_APM_REGION5_ADDR_START_M  (CPU_APM_REGION5_ADDR_START_V << CPU_APM_REGION5_ADDR_START_S)
#define CPU_APM_REGION5_ADDR_START_V  0x0000FFFFU
#define CPU_APM_REGION5_ADDR_START_S  13
/** CPU_APM_REGION5_ADDR_START_H : HRO; bitpos: [31:29]; default: 2;
 *  High 13 bit,  start address of region 5.
 */
#define CPU_APM_REGION5_ADDR_START_H    0x00000007U
#define CPU_APM_REGION5_ADDR_START_H_M  (CPU_APM_REGION5_ADDR_START_H_V << CPU_APM_REGION5_ADDR_START_H_S)
#define CPU_APM_REGION5_ADDR_START_H_V  0x00000007U
#define CPU_APM_REGION5_ADDR_START_H_S  29

/** CPU_APM_REGION5_ADDR_END_REG register
 *  Region address register
 */
#define CPU_APM_REGION5_ADDR_END_REG (DR_REG_CPU_APM_BASE + 0x44)
/** CPU_APM_REGION5_ADDR_END_L : HRO; bitpos: [12:0]; default: 8191;
 *  Low 12 bit, end address of region 5.
 */
#define CPU_APM_REGION5_ADDR_END_L    0x00001FFFU
#define CPU_APM_REGION5_ADDR_END_L_M  (CPU_APM_REGION5_ADDR_END_L_V << CPU_APM_REGION5_ADDR_END_L_S)
#define CPU_APM_REGION5_ADDR_END_L_V  0x00001FFFU
#define CPU_APM_REGION5_ADDR_END_L_S  0
/** CPU_APM_REGION5_ADDR_END : R/W; bitpos: [28:13]; default: 65535;
 *  Configures end address of region 5.
 */
#define CPU_APM_REGION5_ADDR_END    0x0000FFFFU
#define CPU_APM_REGION5_ADDR_END_M  (CPU_APM_REGION5_ADDR_END_V << CPU_APM_REGION5_ADDR_END_S)
#define CPU_APM_REGION5_ADDR_END_V  0x0000FFFFU
#define CPU_APM_REGION5_ADDR_END_S  13
/** CPU_APM_REGION5_ADDR_END_H : HRO; bitpos: [31:29]; default: 2;
 *  High 13 bit,  end address of region 5.
 */
#define CPU_APM_REGION5_ADDR_END_H    0x00000007U
#define CPU_APM_REGION5_ADDR_END_H_M  (CPU_APM_REGION5_ADDR_END_H_V << CPU_APM_REGION5_ADDR_END_H_S)
#define CPU_APM_REGION5_ADDR_END_H_V  0x00000007U
#define CPU_APM_REGION5_ADDR_END_H_S  29

/** CPU_APM_REGION5_ATTR_REG register
 *  Region access authority attribute register
 */
#define CPU_APM_REGION5_ATTR_REG (DR_REG_CPU_APM_BASE + 0x48)
/** CPU_APM_REGION5_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution authority of REE_MODE 0 in region 5.
 */
#define CPU_APM_REGION5_R0_X    (BIT(0))
#define CPU_APM_REGION5_R0_X_M  (CPU_APM_REGION5_R0_X_V << CPU_APM_REGION5_R0_X_S)
#define CPU_APM_REGION5_R0_X_V  0x00000001U
#define CPU_APM_REGION5_R0_X_S  0
/** CPU_APM_REGION5_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write authority of REE_MODE 0 in region 5.
 */
#define CPU_APM_REGION5_R0_W    (BIT(1))
#define CPU_APM_REGION5_R0_W_M  (CPU_APM_REGION5_R0_W_V << CPU_APM_REGION5_R0_W_S)
#define CPU_APM_REGION5_R0_W_V  0x00000001U
#define CPU_APM_REGION5_R0_W_S  1
/** CPU_APM_REGION5_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read authority of REE_MODE 0 in region 5.
 */
#define CPU_APM_REGION5_R0_R    (BIT(2))
#define CPU_APM_REGION5_R0_R_M  (CPU_APM_REGION5_R0_R_V << CPU_APM_REGION5_R0_R_S)
#define CPU_APM_REGION5_R0_R_V  0x00000001U
#define CPU_APM_REGION5_R0_R_S  2
/** CPU_APM_REGION5_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution authority of REE_MODE 1 in region 5.
 */
#define CPU_APM_REGION5_R1_X    (BIT(4))
#define CPU_APM_REGION5_R1_X_M  (CPU_APM_REGION5_R1_X_V << CPU_APM_REGION5_R1_X_S)
#define CPU_APM_REGION5_R1_X_V  0x00000001U
#define CPU_APM_REGION5_R1_X_S  4
/** CPU_APM_REGION5_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write authority of REE_MODE 1 in region 5.
 */
#define CPU_APM_REGION5_R1_W    (BIT(5))
#define CPU_APM_REGION5_R1_W_M  (CPU_APM_REGION5_R1_W_V << CPU_APM_REGION5_R1_W_S)
#define CPU_APM_REGION5_R1_W_V  0x00000001U
#define CPU_APM_REGION5_R1_W_S  5
/** CPU_APM_REGION5_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read authority of REE_MODE 1 in region 5.
 */
#define CPU_APM_REGION5_R1_R    (BIT(6))
#define CPU_APM_REGION5_R1_R_M  (CPU_APM_REGION5_R1_R_V << CPU_APM_REGION5_R1_R_S)
#define CPU_APM_REGION5_R1_R_V  0x00000001U
#define CPU_APM_REGION5_R1_R_S  6
/** CPU_APM_REGION5_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution authority of REE_MODE 2 in region 5.
 */
#define CPU_APM_REGION5_R2_X    (BIT(8))
#define CPU_APM_REGION5_R2_X_M  (CPU_APM_REGION5_R2_X_V << CPU_APM_REGION5_R2_X_S)
#define CPU_APM_REGION5_R2_X_V  0x00000001U
#define CPU_APM_REGION5_R2_X_S  8
/** CPU_APM_REGION5_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write authority of REE_MODE 2 in region 5.
 */
#define CPU_APM_REGION5_R2_W    (BIT(9))
#define CPU_APM_REGION5_R2_W_M  (CPU_APM_REGION5_R2_W_V << CPU_APM_REGION5_R2_W_S)
#define CPU_APM_REGION5_R2_W_V  0x00000001U
#define CPU_APM_REGION5_R2_W_S  9
/** CPU_APM_REGION5_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read authority of REE_MODE 2 in region 5.
 */
#define CPU_APM_REGION5_R2_R    (BIT(10))
#define CPU_APM_REGION5_R2_R_M  (CPU_APM_REGION5_R2_R_V << CPU_APM_REGION5_R2_R_S)
#define CPU_APM_REGION5_R2_R_V  0x00000001U
#define CPU_APM_REGION5_R2_R_S  10
/** CPU_APM_REGION5_TEE_X : R/W; bitpos: [12]; default: 1;
 *  Configures the execution authority of TEE_MODE in region 5.
 */
#define CPU_APM_REGION5_TEE_X    (BIT(12))
#define CPU_APM_REGION5_TEE_X_M  (CPU_APM_REGION5_TEE_X_V << CPU_APM_REGION5_TEE_X_S)
#define CPU_APM_REGION5_TEE_X_V  0x00000001U
#define CPU_APM_REGION5_TEE_X_S  12
/** CPU_APM_REGION5_TEE_W : R/W; bitpos: [13]; default: 1;
 *  Configures the write authority of TEE_MODE in region 5.
 */
#define CPU_APM_REGION5_TEE_W    (BIT(13))
#define CPU_APM_REGION5_TEE_W_M  (CPU_APM_REGION5_TEE_W_V << CPU_APM_REGION5_TEE_W_S)
#define CPU_APM_REGION5_TEE_W_V  0x00000001U
#define CPU_APM_REGION5_TEE_W_S  13
/** CPU_APM_REGION5_TEE_R : R/W; bitpos: [14]; default: 1;
 *  Configures the read authority of TEE_MODE in region 5.
 */
#define CPU_APM_REGION5_TEE_R    (BIT(14))
#define CPU_APM_REGION5_TEE_R_M  (CPU_APM_REGION5_TEE_R_V << CPU_APM_REGION5_TEE_R_S)
#define CPU_APM_REGION5_TEE_R_V  0x00000001U
#define CPU_APM_REGION5_TEE_R_S  14
/** CPU_APM_REGION5_LOCK : R/W; bitpos: [16]; default: 0;
 *  Set 1 to lock region0 configuration
 */
#define CPU_APM_REGION5_LOCK    (BIT(16))
#define CPU_APM_REGION5_LOCK_M  (CPU_APM_REGION5_LOCK_V << CPU_APM_REGION5_LOCK_S)
#define CPU_APM_REGION5_LOCK_V  0x00000001U
#define CPU_APM_REGION5_LOCK_S  16

