espressif/esp-idf/components/soc/esp32s31/register/soc/cpu_apm_reg.h
/** CPU_APM_M1_STATUS_CLR_REG register
 *  M1 status clear register
 */
#define CPU_APM_M1_STATUS_CLR_REG (DR_REG_CPU_APM_BASE + 0xdc)
/** CPU_APM_M1_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define CPU_APM_M1_EXCEPTION_STATUS_CLR    (BIT(0))
#define CPU_APM_M1_EXCEPTION_STATUS_CLR_M  (CPU_APM_M1_EXCEPTION_STATUS_CLR_V << CPU_APM_M1_EXCEPTION_STATUS_CLR_S)
#define CPU_APM_M1_EXCEPTION_STATUS_CLR_V  0x00000001U
#define CPU_APM_M1_EXCEPTION_STATUS_CLR_S  0

/** CPU_APM_M1_EXCEPTION_INFO0_REG register
 *  M1 exception_info0 register
 */
#define CPU_APM_M1_EXCEPTION_INFO0_REG (DR_REG_CPU_APM_BASE + 0xe0)
/** CPU_APM_M1_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region.
 */
#define CPU_APM_M1_EXCEPTION_REGION    0x000000FFU
#define CPU_APM_M1_EXCEPTION_REGION_M  (CPU_APM_M1_EXCEPTION_REGION_V << CPU_APM_M1_EXCEPTION_REGION_S)
#define CPU_APM_M1_EXCEPTION_REGION_V  0x000000FFU
#define CPU_APM_M1_EXCEPTION_REGION_S  0
/** CPU_APM_M1_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode.
 */
#define CPU_APM_M1_EXCEPTION_MODE    0x00000003U
#define CPU_APM_M1_EXCEPTION_MODE_M  (CPU_APM_M1_EXCEPTION_MODE_V << CPU_APM_M1_EXCEPTION_MODE_S)
#define CPU_APM_M1_EXCEPTION_MODE_V  0x00000003U
#define CPU_APM_M1_EXCEPTION_MODE_S  16
/** CPU_APM_M1_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents exception id information.
 */
#define CPU_APM_M1_EXCEPTION_ID    0x0000001FU
#define CPU_APM_M1_EXCEPTION_ID_M  (CPU_APM_M1_EXCEPTION_ID_V << CPU_APM_M1_EXCEPTION_ID_S)
#define CPU_APM_M1_EXCEPTION_ID_V  0x0000001FU
#define CPU_APM_M1_EXCEPTION_ID_S  18

/** CPU_APM_M1_EXCEPTION_INFO1_REG register
 *  M1 exception_info1 register
 */
#define CPU_APM_M1_EXCEPTION_INFO1_REG (DR_REG_CPU_APM_BASE + 0xe4)
/** CPU_APM_M1_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define CPU_APM_M1_EXCEPTION_ADDR    0xFFFFFFFFU
#define CPU_APM_M1_EXCEPTION_ADDR_M  (CPU_APM_M1_EXCEPTION_ADDR_V << CPU_APM_M1_EXCEPTION_ADDR_S)
#define CPU_APM_M1_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define CPU_APM_M1_EXCEPTION_ADDR_S  0

/** CPU_APM_M2_STATUS_REG register
 *  M2 status register
 */
#define CPU_APM_M2_STATUS_REG (DR_REG_CPU_APM_BASE + 0xe8)
/** CPU_APM_M2_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define CPU_APM_M2_EXCEPTION_STATUS    0x00000003U
#define CPU_APM_M2_EXCEPTION_STATUS_M  (CPU_APM_M2_EXCEPTION_STATUS_V << CPU_APM_M2_EXCEPTION_STATUS_S)
#define CPU_APM_M2_EXCEPTION_STATUS_V  0x00000003U
#define CPU_APM_M2_EXCEPTION_STATUS_S  0

/** CPU_APM_M2_STATUS_CLR_REG register
 *  M2 status clear register
 */
#define CPU_APM_M2_STATUS_CLR_REG (DR_REG_CPU_APM_BASE + 0xec)
/** CPU_APM_M2_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define CPU_APM_M2_EXCEPTION_STATUS_CLR    (BIT(0))
#define CPU_APM_M2_EXCEPTION_STATUS_CLR_M  (CPU_APM_M2_EXCEPTION_STATUS_CLR_V << CPU_APM_M2_EXCEPTION_STATUS_CLR_S)
#define CPU_APM_M2_EXCEPTION_STATUS_CLR_V  0x00000001U
#define CPU_APM_M2_EXCEPTION_STATUS_CLR_S  0

/** CPU_APM_M2_EXCEPTION_INFO0_REG register
 *  M2 exception_info0 register
 */
#define CPU_APM_M2_EXCEPTION_INFO0_REG (DR_REG_CPU_APM_BASE + 0xf0)
/** CPU_APM_M2_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region.
 */
#define CPU_APM_M2_EXCEPTION_REGION    0x000000FFU
#define CPU_APM_M2_EXCEPTION_REGION_M  (CPU_APM_M2_EXCEPTION_REGION_V << CPU_APM_M2_EXCEPTION_REGION_S)
#define CPU_APM_M2_EXCEPTION_REGION_V  0x000000FFU
#define CPU_APM_M2_EXCEPTION_REGION_S  0
/** CPU_APM_M2_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode.
 */
#define CPU_APM_M2_EXCEPTION_MODE    0x00000003U
#define CPU_APM_M2_EXCEPTION_MODE_M  (CPU_APM_M2_EXCEPTION_MODE_V << CPU_APM_M2_EXCEPTION_MODE_S)
#define CPU_APM_M2_EXCEPTION_MODE_V  0x00000003U
#define CPU_APM_M2_EXCEPTION_MODE_S  16
/** CPU_APM_M2_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents exception id information.
 */
#define CPU_APM_M2_EXCEPTION_ID    0x0000001FU
#define CPU_APM_M2_EXCEPTION_ID_M  (CPU_APM_M2_EXCEPTION_ID_V << CPU_APM_M2_EXCEPTION_ID_S)
#define CPU_APM_M2_EXCEPTION_ID_V  0x0000001FU
#define CPU_APM_M2_EXCEPTION_ID_S  18

/** CPU_APM_M2_EXCEPTION_INFO1_REG register
 *  M2 exception_info1 register
 */
#define CPU_APM_M2_EXCEPTION_INFO1_REG (DR_REG_CPU_APM_BASE + 0xf4)
/** CPU_APM_M2_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define CPU_APM_M2_EXCEPTION_ADDR    0xFFFFFFFFU
#define CPU_APM_M2_EXCEPTION_ADDR_M  (CPU_APM_M2_EXCEPTION_ADDR_V << CPU_APM_M2_EXCEPTION_ADDR_S)
#define CPU_APM_M2_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define CPU_APM_M2_EXCEPTION_ADDR_S  0

/** CPU_APM_M3_STATUS_REG register
 *  M3 status register
 */
#define CPU_APM_M3_STATUS_REG (DR_REG_CPU_APM_BASE + 0xf8)
/** CPU_APM_M3_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents authority_exception
 *  bit1: 1 represents space_exception
 */
#define CPU_APM_M3_EXCEPTION_STATUS    0x00000003U
#define CPU_APM_M3_EXCEPTION_STATUS_M  (CPU_APM_M3_EXCEPTION_STATUS_V << CPU_APM_M3_EXCEPTION_STATUS_S)
#define CPU_APM_M3_EXCEPTION_STATUS_V  0x00000003U
#define CPU_APM_M3_EXCEPTION_STATUS_S  0

/** CPU_APM_M3_STATUS_CLR_REG register
 *  M3 status clear register
 */
#define CPU_APM_M3_STATUS_CLR_REG (DR_REG_CPU_APM_BASE + 0xfc)
/** CPU_APM_M3_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define CPU_APM_M3_EXCEPTION_STATUS_CLR    (BIT(0))
#define CPU_APM_M3_EXCEPTION_STATUS_CLR_M  (CPU_APM_M3_EXCEPTION_STATUS_CLR_V << CPU_APM_M3_EXCEPTION_STATUS_CLR_S)
#define CPU_APM_M3_EXCEPTION_STATUS_CLR_V  0x00000001U
#define CPU_APM_M3_EXCEPTION_STATUS_CLR_S  0

/** CPU_APM_M3_EXCEPTION_INFO0_REG register
 *  M3 exception_info0 register
 */
#define CPU_APM_M3_EXCEPTION_INFO0_REG (DR_REG_CPU_APM_BASE + 0x100)
/** CPU_APM_M3_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents exception region.
 */
#define CPU_APM_M3_EXCEPTION_REGION    0x000000FFU
#define CPU_APM_M3_EXCEPTION_REGION_M  (CPU_APM_M3_EXCEPTION_REGION_V << CPU_APM_M3_EXCEPTION_REGION_S)
#define CPU_APM_M3_EXCEPTION_REGION_V  0x000000FFU
#define CPU_APM_M3_EXCEPTION_REGION_S  0
/** CPU_APM_M3_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents exception mode.
 */
#define CPU_APM_M3_EXCEPTION_MODE    0x00000003U
#define CPU_APM_M3_EXCEPTION_MODE_M  (CPU_APM_M3_EXCEPTION_MODE_V << CPU_APM_M3_EXCEPTION_MODE_S)
#define CPU_APM_M3_EXCEPTION_MODE_V  0x00000003U
#define CPU_APM_M3_EXCEPTION_MODE_S  16
/** CPU_APM_M3_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents exception id information.
 */
#define CPU_APM_M3_EXCEPTION_ID    0x0000001FU
#define CPU_APM_M3_EXCEPTION_ID_M  (CPU_APM_M3_EXCEPTION_ID_V << CPU_APM_M3_EXCEPTION_ID_S)
#define CPU_APM_M3_EXCEPTION_ID_V  0x0000001FU
#define CPU_APM_M3_EXCEPTION_ID_S  18

/** CPU_APM_M3_EXCEPTION_INFO1_REG register
 *  M3 exception_info1 register
 */
#define CPU_APM_M3_EXCEPTION_INFO1_REG (DR_REG_CPU_APM_BASE + 0x104)
/** CPU_APM_M3_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents exception addr.
 */
#define CPU_APM_M3_EXCEPTION_ADDR    0xFFFFFFFFU
#define CPU_APM_M3_EXCEPTION_ADDR_M  (CPU_APM_M3_EXCEPTION_ADDR_V << CPU_APM_M3_EXCEPTION_ADDR_S)
#define CPU_APM_M3_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define CPU_APM_M3_EXCEPTION_ADDR_S  0

